#====================================
#splend dataファイルのデータその2 achieve類
#====================================
#　!は使用中を表すため、位置を変更することはできない

#achieve_(key)の(key)の部分は本体のuserデータと同期しているので,array自体の名称変更は不可

#achieve処理はrequire dataを少なくするために分割した方がいい?
@achieve_max_excav = (
  [0,'',0,'',sub{return;}],
  [1,'',5,'採掘家ｶｰﾄﾞを5枚集める',sub{return;}],
  [2,'',20,'採掘家ｶｰﾄﾞを20枚集める',sub{return;}],
  [3,'',50,'採掘家ｶｰﾄﾞを50枚集める',sub{return;}],
  [4,'',100,'採掘家ｶｰﾄﾞを100枚集める',sub{return;}],
  );#no,name(key),達成条件(数値),達成条件(表示文),報酬処理

@achieve_max_field = (
  [0,'',0,'',sub{return;}],
  [1,'',1,'領地ｶｰﾄﾞを1枚集める',sub{return;}],
  [2,'',5,'領地ｶｰﾄﾞを5枚集める',sub{return;}],
  [3,'',10,'領地ｶｰﾄﾞを10枚集める',sub{return;}],
  [4,'',20,'領地ｶｰﾄﾞを20枚集める',sub{return;}],
  );

@achieve_max_kind_map = (
  [0,'',0,'',sub{return;}],
  [1,'',10,'10種類以上のマップに止まる',sub{return;}],
  [2,'',20,'20種類以上のマップに止まる',sub{return;}],
  [3,'',25,'25種類以上のマップに止まる',sub{return;}],
  [4,'',30,'30種類以上のマップに止まる',sub{return;}],
  );

@achieve_max_range_map = (
  [0,'',0,'',sub{return;}],
  [1,'',100,'100マス以上進む',sub{return;}],
  [2,'',200,'200マス以上進む',sub{return;}],
  [3,'',300,'300マス以上進む',sub{return;}],
  [4,'',500,'500マス以上進む',sub{return;}],
  );

@achieve_max_weather_damage = ();

1;#削除不可
